GopalSaraf/Practicals/PSDL/include/proc/pic12f1572.inc
// Register: CWG1CON2
#define CWG1CON2 CWG1CON2
CWG1CON2                                 equ 0695h
// bitfield definitions
CWG1CON2_G1ASDSFLT_POSN                  equ 0001h
CWG1CON2_G1ASDSFLT_POSITION              equ 0001h
CWG1CON2_G1ASDSFLT_SIZE                  equ 0001h
CWG1CON2_G1ASDSFLT_LENGTH                equ 0001h
CWG1CON2_G1ASDSFLT_MASK                  equ 0002h
CWG1CON2_G1ASDSC1_POSN                   equ 0002h
CWG1CON2_G1ASDSC1_POSITION               equ 0002h
CWG1CON2_G1ASDSC1_SIZE                   equ 0001h
CWG1CON2_G1ASDSC1_LENGTH                 equ 0001h
CWG1CON2_G1ASDSC1_MASK                   equ 0004h
CWG1CON2_G1ARSEN_POSN                    equ 0006h
CWG1CON2_G1ARSEN_POSITION                equ 0006h
CWG1CON2_G1ARSEN_SIZE                    equ 0001h
CWG1CON2_G1ARSEN_LENGTH                  equ 0001h
CWG1CON2_G1ARSEN_MASK                    equ 0040h
CWG1CON2_G1ASE_POSN                      equ 0007h
CWG1CON2_G1ASE_POSITION                  equ 0007h
CWG1CON2_G1ASE_SIZE                      equ 0001h
CWG1CON2_G1ASE_LENGTH                    equ 0001h
CWG1CON2_G1ASE_MASK                      equ 0080h

// Register: PWMEN
#define PWMEN PWMEN
PWMEN                                    equ 0D8Eh
// bitfield definitions
PWMEN_PWM1EN_A_POSN                      equ 0000h
PWMEN_PWM1EN_A_POSITION                  equ 0000h
PWMEN_PWM1EN_A_SIZE                      equ 0001h
PWMEN_PWM1EN_A_LENGTH                    equ 0001h
PWMEN_PWM1EN_A_MASK                      equ 0001h
PWMEN_PWM2EN_A_POSN                      equ 0001h
PWMEN_PWM2EN_A_POSITION                  equ 0001h
PWMEN_PWM2EN_A_SIZE                      equ 0001h
PWMEN_PWM2EN_A_LENGTH                    equ 0001h
PWMEN_PWM2EN_A_MASK                      equ 0002h
PWMEN_PWM3EN_A_POSN                      equ 0002h
PWMEN_PWM3EN_A_POSITION                  equ 0002h
PWMEN_PWM3EN_A_SIZE                      equ 0001h
PWMEN_PWM3EN_A_LENGTH                    equ 0001h
PWMEN_PWM3EN_A_MASK                      equ 0004h
PWMEN_MPWM1EN_POSN                       equ 0000h
PWMEN_MPWM1EN_POSITION                   equ 0000h
PWMEN_MPWM1EN_SIZE                       equ 0001h
PWMEN_MPWM1EN_LENGTH                     equ 0001h
PWMEN_MPWM1EN_MASK                       equ 0001h
PWMEN_MPWM2EN_POSN                       equ 0001h
PWMEN_MPWM2EN_POSITION                   equ 0001h
PWMEN_MPWM2EN_SIZE                       equ 0001h
PWMEN_MPWM2EN_LENGTH                     equ 0001h
PWMEN_MPWM2EN_MASK                       equ 0002h
PWMEN_MPWM3EN_POSN                       equ 0002h
PWMEN_MPWM3EN_POSITION                   equ 0002h
PWMEN_MPWM3EN_SIZE                       equ 0001h
PWMEN_MPWM3EN_LENGTH                     equ 0001h
PWMEN_MPWM3EN_MASK                       equ 0004h

// Register: PWMLD
#define PWMLD PWMLD
PWMLD                                    equ 0D8Fh
// bitfield definitions
PWMLD_PWM1LDA_A_POSN                     equ 0000h
PWMLD_PWM1LDA_A_POSITION                 equ 0000h
PWMLD_PWM1LDA_A_SIZE                     equ 0001h
PWMLD_PWM1LDA_A_LENGTH                   equ 0001h
PWMLD_PWM1LDA_A_MASK                     equ 0001h
PWMLD_PWM2LDA_A_POSN                     equ 0001h
PWMLD_PWM2LDA_A_POSITION                 equ 0001h
PWMLD_PWM2LDA_A_SIZE                     equ 0001h
PWMLD_PWM2LDA_A_LENGTH                   equ 0001h
PWMLD_PWM2LDA_A_MASK                     equ 0002h
PWMLD_PWM3LDA_A_POSN                     equ 0002h
PWMLD_PWM3LDA_A_POSITION                 equ 0002h
PWMLD_PWM3LDA_A_SIZE                     equ 0001h
PWMLD_PWM3LDA_A_LENGTH                   equ 0001h
PWMLD_PWM3LDA_A_MASK                     equ 0004h
PWMLD_MPWM1LD_POSN                       equ 0000h
PWMLD_MPWM1LD_POSITION                   equ 0000h
PWMLD_MPWM1LD_SIZE                       equ 0001h
PWMLD_MPWM1LD_LENGTH                     equ 0001h
PWMLD_MPWM1LD_MASK                       equ 0001h
PWMLD_MPWM2LD_POSN                       equ 0001h
PWMLD_MPWM2LD_POSITION                   equ 0001h
PWMLD_MPWM2LD_SIZE                       equ 0001h
PWMLD_MPWM2LD_LENGTH                     equ 0001h
PWMLD_MPWM2LD_MASK                       equ 0002h
PWMLD_MPWM3LD_POSN                       equ 0002h
PWMLD_MPWM3LD_POSITION                   equ 0002h
PWMLD_MPWM3LD_SIZE                       equ 0001h
PWMLD_MPWM3LD_LENGTH                     equ 0001h
PWMLD_MPWM3LD_MASK                       equ 0004h

// Register: PWMOUT
#define PWMOUT PWMOUT
PWMOUT                                   equ 0D90h
// bitfield definitions
PWMOUT_PWM1OUT_A_POSN                    equ 0000h
PWMOUT_PWM1OUT_A_POSITION                equ 0000h
PWMOUT_PWM1OUT_A_SIZE                    equ 0001h
PWMOUT_PWM1OUT_A_LENGTH                  equ 0001h
PWMOUT_PWM1OUT_A_MASK                    equ 0001h
PWMOUT_PWM2OUT_A_POSN                    equ 0001h
PWMOUT_PWM2OUT_A_POSITION                equ 0001h
PWMOUT_PWM2OUT_A_SIZE                    equ 0001h
PWMOUT_PWM2OUT_A_LENGTH                  equ 0001h
PWMOUT_PWM2OUT_A_MASK                    equ 0002h
PWMOUT_PWM3OUT_A_POSN                    equ 0002h
PWMOUT_PWM3OUT_A_POSITION                equ 0002h
PWMOUT_PWM3OUT_A_SIZE                    equ 0001h
PWMOUT_PWM3OUT_A_LENGTH                  equ 0001h
PWMOUT_PWM3OUT_A_MASK                    equ 0004h
PWMOUT_MPWM1OUT_POSN                     equ 0000h
PWMOUT_MPWM1OUT_POSITION                 equ 0000h
PWMOUT_MPWM1OUT_SIZE                     equ 0001h
PWMOUT_MPWM1OUT_LENGTH                   equ 0001h
PWMOUT_MPWM1OUT_MASK                     equ 0001h
PWMOUT_MPWM2OUT_POSN                     equ 0001h
PWMOUT_MPWM2OUT_POSITION                 equ 0001h
PWMOUT_MPWM2OUT_SIZE                     equ 0001h
PWMOUT_MPWM2OUT_LENGTH                   equ 0001h
PWMOUT_MPWM2OUT_MASK                     equ 0002h
PWMOUT_MPWM3OUT_POSN                     equ 0002h
PWMOUT_MPWM3OUT_POSITION                 equ 0002h
PWMOUT_MPWM3OUT_SIZE                     equ 0001h
PWMOUT_MPWM3OUT_LENGTH                   equ 0001h
PWMOUT_MPWM3OUT_MASK                     equ 0004h

