GopalSaraf/Practicals/PSDL/include/proc/pic12f1572.inc
// Register: PWM1PHL
#define PWM1PHL PWM1PHL
PWM1PHL                                  equ 0D91h
// bitfield definitions
PWM1PHL_PH_POSN                          equ 0000h
PWM1PHL_PH_POSITION                      equ 0000h
PWM1PHL_PH_SIZE                          equ 0008h
PWM1PHL_PH_LENGTH                        equ 0008h
PWM1PHL_PH_MASK                          equ 00FFh
PWM1PHL_PWM1PHL0_POSN                    equ 0000h
PWM1PHL_PWM1PHL0_POSITION                equ 0000h
PWM1PHL_PWM1PHL0_SIZE                    equ 0001h
PWM1PHL_PWM1PHL0_LENGTH                  equ 0001h
PWM1PHL_PWM1PHL0_MASK                    equ 0001h
PWM1PHL_PWM1PHL1_POSN                    equ 0001h
PWM1PHL_PWM1PHL1_POSITION                equ 0001h
PWM1PHL_PWM1PHL1_SIZE                    equ 0001h
PWM1PHL_PWM1PHL1_LENGTH                  equ 0001h
PWM1PHL_PWM1PHL1_MASK                    equ 0002h
PWM1PHL_PWM1PHL2_POSN                    equ 0002h
PWM1PHL_PWM1PHL2_POSITION                equ 0002h
PWM1PHL_PWM1PHL2_SIZE                    equ 0001h
PWM1PHL_PWM1PHL2_LENGTH                  equ 0001h
PWM1PHL_PWM1PHL2_MASK                    equ 0004h
PWM1PHL_PWM1PHL3_POSN                    equ 0003h
PWM1PHL_PWM1PHL3_POSITION                equ 0003h
PWM1PHL_PWM1PHL3_SIZE                    equ 0001h
PWM1PHL_PWM1PHL3_LENGTH                  equ 0001h
PWM1PHL_PWM1PHL3_MASK                    equ 0008h
PWM1PHL_PWM1PHL4_POSN                    equ 0004h
PWM1PHL_PWM1PHL4_POSITION                equ 0004h
PWM1PHL_PWM1PHL4_SIZE                    equ 0001h
PWM1PHL_PWM1PHL4_LENGTH                  equ 0001h
PWM1PHL_PWM1PHL4_MASK                    equ 0010h
PWM1PHL_PWM1PHL5_POSN                    equ 0005h
PWM1PHL_PWM1PHL5_POSITION                equ 0005h
PWM1PHL_PWM1PHL5_SIZE                    equ 0001h
PWM1PHL_PWM1PHL5_LENGTH                  equ 0001h
PWM1PHL_PWM1PHL5_MASK                    equ 0020h
PWM1PHL_PWM1PHL6_POSN                    equ 0006h
PWM1PHL_PWM1PHL6_POSITION                equ 0006h
PWM1PHL_PWM1PHL6_SIZE                    equ 0001h
PWM1PHL_PWM1PHL6_LENGTH                  equ 0001h
PWM1PHL_PWM1PHL6_MASK                    equ 0040h
PWM1PHL_PWM1PHL7_POSN                    equ 0007h
PWM1PHL_PWM1PHL7_POSITION                equ 0007h
PWM1PHL_PWM1PHL7_SIZE                    equ 0001h
PWM1PHL_PWM1PHL7_LENGTH                  equ 0001h
PWM1PHL_PWM1PHL7_MASK                    equ 0080h
PWM1PHL_PWM1PHL_POSN                     equ 0000h
PWM1PHL_PWM1PHL_POSITION                 equ 0000h
PWM1PHL_PWM1PHL_SIZE                     equ 0008h
PWM1PHL_PWM1PHL_LENGTH                   equ 0008h
PWM1PHL_PWM1PHL_MASK                     equ 00FFh

// Register: PWM1PHH
#define PWM1PHH PWM1PHH
PWM1PHH                                  equ 0D92h
// bitfield definitions
PWM1PHH_PH_POSN                          equ 0000h
PWM1PHH_PH_POSITION                      equ 0000h
PWM1PHH_PH_SIZE                          equ 0008h
PWM1PHH_PH_LENGTH                        equ 0008h
PWM1PHH_PH_MASK                          equ 00FFh
PWM1PHH_PWM1PHH0_POSN                    equ 0000h
PWM1PHH_PWM1PHH0_POSITION                equ 0000h
PWM1PHH_PWM1PHH0_SIZE                    equ 0001h
PWM1PHH_PWM1PHH0_LENGTH                  equ 0001h
PWM1PHH_PWM1PHH0_MASK                    equ 0001h
PWM1PHH_PWM1PHH1_POSN                    equ 0001h
PWM1PHH_PWM1PHH1_POSITION                equ 0001h
PWM1PHH_PWM1PHH1_SIZE                    equ 0001h
PWM1PHH_PWM1PHH1_LENGTH                  equ 0001h
PWM1PHH_PWM1PHH1_MASK                    equ 0002h
PWM1PHH_PWM1PHH2_POSN                    equ 0002h
PWM1PHH_PWM1PHH2_POSITION                equ 0002h
PWM1PHH_PWM1PHH2_SIZE                    equ 0001h
PWM1PHH_PWM1PHH2_LENGTH                  equ 0001h
PWM1PHH_PWM1PHH2_MASK                    equ 0004h
PWM1PHH_PWM1PHH3_POSN                    equ 0003h
PWM1PHH_PWM1PHH3_POSITION                equ 0003h
PWM1PHH_PWM1PHH3_SIZE                    equ 0001h
PWM1PHH_PWM1PHH3_LENGTH                  equ 0001h
PWM1PHH_PWM1PHH3_MASK                    equ 0008h
PWM1PHH_PWM1PHH4_POSN                    equ 0004h
PWM1PHH_PWM1PHH4_POSITION                equ 0004h
PWM1PHH_PWM1PHH4_SIZE                    equ 0001h
PWM1PHH_PWM1PHH4_LENGTH                  equ 0001h
PWM1PHH_PWM1PHH4_MASK                    equ 0010h
PWM1PHH_PWM1PHH5_POSN                    equ 0005h
PWM1PHH_PWM1PHH5_POSITION                equ 0005h
PWM1PHH_PWM1PHH5_SIZE                    equ 0001h
PWM1PHH_PWM1PHH5_LENGTH                  equ 0001h
PWM1PHH_PWM1PHH5_MASK                    equ 0020h
PWM1PHH_PWM1PHH6_POSN                    equ 0006h
PWM1PHH_PWM1PHH6_POSITION                equ 0006h
PWM1PHH_PWM1PHH6_SIZE                    equ 0001h
PWM1PHH_PWM1PHH6_LENGTH                  equ 0001h
PWM1PHH_PWM1PHH6_MASK                    equ 0040h
PWM1PHH_PWM1PHH7_POSN                    equ 0007h
PWM1PHH_PWM1PHH7_POSITION                equ 0007h
PWM1PHH_PWM1PHH7_SIZE                    equ 0001h
PWM1PHH_PWM1PHH7_LENGTH                  equ 0001h
PWM1PHH_PWM1PHH7_MASK                    equ 0080h
PWM1PHH_PWM1PHH_POSN                     equ 0000h
PWM1PHH_PWM1PHH_POSITION                 equ 0000h
PWM1PHH_PWM1PHH_SIZE                     equ 0008h
PWM1PHH_PWM1PHH_LENGTH                   equ 0008h
PWM1PHH_PWM1PHH_MASK                     equ 00FFh

// Register: PWM1DCL
#define PWM1DCL PWM1DCL
PWM1DCL                                  equ 0D93h
// bitfield definitions
PWM1DCL_DC_POSN                          equ 0000h
PWM1DCL_DC_POSITION                      equ 0000h
PWM1DCL_DC_SIZE                          equ 0008h
PWM1DCL_DC_LENGTH                        equ 0008h
PWM1DCL_DC_MASK                          equ 00FFh
PWM1DCL_PWM1DCL0_POSN                    equ 0000h
PWM1DCL_PWM1DCL0_POSITION                equ 0000h
PWM1DCL_PWM1DCL0_SIZE                    equ 0001h
PWM1DCL_PWM1DCL0_LENGTH                  equ 0001h
PWM1DCL_PWM1DCL0_MASK                    equ 0001h
PWM1DCL_PWM1DCL1_POSN                    equ 0001h
PWM1DCL_PWM1DCL1_POSITION                equ 0001h
PWM1DCL_PWM1DCL1_SIZE                    equ 0001h
PWM1DCL_PWM1DCL1_LENGTH                  equ 0001h
PWM1DCL_PWM1DCL1_MASK                    equ 0002h
PWM1DCL_PWM1DCL2_POSN                    equ 0002h
PWM1DCL_PWM1DCL2_POSITION                equ 0002h
PWM1DCL_PWM1DCL2_SIZE                    equ 0001h
PWM1DCL_PWM1DCL2_LENGTH                  equ 0001h
PWM1DCL_PWM1DCL2_MASK                    equ 0004h
PWM1DCL_PWM1DCL3_POSN                    equ 0003h
PWM1DCL_PWM1DCL3_POSITION                equ 0003h
PWM1DCL_PWM1DCL3_SIZE                    equ 0001h
PWM1DCL_PWM1DCL3_LENGTH                  equ 0001h
PWM1DCL_PWM1DCL3_MASK                    equ 0008h
PWM1DCL_PWM1DCL4_POSN                    equ 0004h
PWM1DCL_PWM1DCL4_POSITION                equ 0004h
PWM1DCL_PWM1DCL4_SIZE                    equ 0001h
PWM1DCL_PWM1DCL4_LENGTH                  equ 0001h
PWM1DCL_PWM1DCL4_MASK                    equ 0010h
PWM1DCL_PWM1DCL5_POSN                    equ 0005h
PWM1DCL_PWM1DCL5_POSITION                equ 0005h
PWM1DCL_PWM1DCL5_SIZE                    equ 0001h
PWM1DCL_PWM1DCL5_LENGTH                  equ 0001h
PWM1DCL_PWM1DCL5_MASK                    equ 0020h
PWM1DCL_PWM1DCL6_POSN                    equ 0006h
PWM1DCL_PWM1DCL6_POSITION                equ 0006h
PWM1DCL_PWM1DCL6_SIZE                    equ 0001h
PWM1DCL_PWM1DCL6_LENGTH                  equ 0001h
PWM1DCL_PWM1DCL6_MASK                    equ 0040h
PWM1DCL_PWM1DCL7_POSN                    equ 0007h
PWM1DCL_PWM1DCL7_POSITION                equ 0007h
PWM1DCL_PWM1DCL7_SIZE                    equ 0001h
PWM1DCL_PWM1DCL7_LENGTH                  equ 0001h
PWM1DCL_PWM1DCL7_MASK                    equ 0080h
PWM1DCL_PWM1DCL_POSN                     equ 0000h
PWM1DCL_PWM1DCL_POSITION                 equ 0000h
PWM1DCL_PWM1DCL_SIZE                     equ 0008h
PWM1DCL_PWM1DCL_LENGTH                   equ 0008h
PWM1DCL_PWM1DCL_MASK                     equ 00FFh

// Register: PWM1DCH
#define PWM1DCH PWM1DCH
PWM1DCH                                  equ 0D94h
// bitfield definitions
PWM1DCH_DC_POSN                          equ 0000h
PWM1DCH_DC_POSITION                      equ 0000h
PWM1DCH_DC_SIZE                          equ 0008h
PWM1DCH_DC_LENGTH                        equ 0008h
PWM1DCH_DC_MASK                          equ 00FFh
PWM1DCH_PWM1DCH0_POSN                    equ 0000h
PWM1DCH_PWM1DCH0_POSITION                equ 0000h
PWM1DCH_PWM1DCH0_SIZE                    equ 0001h
PWM1DCH_PWM1DCH0_LENGTH                  equ 0001h
PWM1DCH_PWM1DCH0_MASK                    equ 0001h
PWM1DCH_PWM1DCH1_POSN                    equ 0001h
PWM1DCH_PWM1DCH1_POSITION                equ 0001h
PWM1DCH_PWM1DCH1_SIZE                    equ 0001h
PWM1DCH_PWM1DCH1_LENGTH                  equ 0001h
PWM1DCH_PWM1DCH1_MASK                    equ 0002h
PWM1DCH_PWM1DCH2_POSN                    equ 0002h
PWM1DCH_PWM1DCH2_POSITION                equ 0002h
PWM1DCH_PWM1DCH2_SIZE                    equ 0001h
PWM1DCH_PWM1DCH2_LENGTH                  equ 0001h
PWM1DCH_PWM1DCH2_MASK                    equ 0004h
PWM1DCH_PWM1DCH3_POSN                    equ 0003h
PWM1DCH_PWM1DCH3_POSITION                equ 0003h
PWM1DCH_PWM1DCH3_SIZE                    equ 0001h
PWM1DCH_PWM1DCH3_LENGTH                  equ 0001h
PWM1DCH_PWM1DCH3_MASK                    equ 0008h
PWM1DCH_PWM1DCH4_POSN                    equ 0004h
PWM1DCH_PWM1DCH4_POSITION                equ 0004h
PWM1DCH_PWM1DCH4_SIZE                    equ 0001h
PWM1DCH_PWM1DCH4_LENGTH                  equ 0001h
PWM1DCH_PWM1DCH4_MASK                    equ 0010h
PWM1DCH_PWM1DCH5_POSN                    equ 0005h
PWM1DCH_PWM1DCH5_POSITION                equ 0005h
PWM1DCH_PWM1DCH5_SIZE                    equ 0001h
PWM1DCH_PWM1DCH5_LENGTH                  equ 0001h
PWM1DCH_PWM1DCH5_MASK                    equ 0020h
PWM1DCH_PWM1DCH6_POSN                    equ 0006h
PWM1DCH_PWM1DCH6_POSITION                equ 0006h
PWM1DCH_PWM1DCH6_SIZE                    equ 0001h
PWM1DCH_PWM1DCH6_LENGTH                  equ 0001h
PWM1DCH_PWM1DCH6_MASK                    equ 0040h
PWM1DCH_PWM1DCH7_POSN                    equ 0007h
PWM1DCH_PWM1DCH7_POSITION                equ 0007h
PWM1DCH_PWM1DCH7_SIZE                    equ 0001h
PWM1DCH_PWM1DCH7_LENGTH                  equ 0001h
PWM1DCH_PWM1DCH7_MASK                    equ 0080h
PWM1DCH_PWM1DCH_POSN                     equ 0000h
PWM1DCH_PWM1DCH_POSITION                 equ 0000h
PWM1DCH_PWM1DCH_SIZE                     equ 0008h
PWM1DCH_PWM1DCH_LENGTH                   equ 0008h
PWM1DCH_PWM1DCH_MASK                     equ 00FFh

// Register: PWM1PRL
#define PWM1PRL PWM1PRL
PWM1PRL                                  equ 0D95h
// bitfield definitions
PWM1PRL_PR_POSN                          equ 0000h
PWM1PRL_PR_POSITION                      equ 0000h
PWM1PRL_PR_SIZE                          equ 0008h
PWM1PRL_PR_LENGTH                        equ 0008h
PWM1PRL_PR_MASK                          equ 00FFh
PWM1PRL_PWM1PRL0_POSN                    equ 0000h
PWM1PRL_PWM1PRL0_POSITION                equ 0000h
PWM1PRL_PWM1PRL0_SIZE                    equ 0001h
PWM1PRL_PWM1PRL0_LENGTH                  equ 0001h
PWM1PRL_PWM1PRL0_MASK                    equ 0001h
PWM1PRL_PWM1PRL1_POSN                    equ 0001h
PWM1PRL_PWM1PRL1_POSITION                equ 0001h
PWM1PRL_PWM1PRL1_SIZE                    equ 0001h
PWM1PRL_PWM1PRL1_LENGTH                  equ 0001h
PWM1PRL_PWM1PRL1_MASK                    equ 0002h
PWM1PRL_PWM1PRL2_POSN                    equ 0002h
PWM1PRL_PWM1PRL2_POSITION                equ 0002h
PWM1PRL_PWM1PRL2_SIZE                    equ 0001h
PWM1PRL_PWM1PRL2_LENGTH                  equ 0001h
PWM1PRL_PWM1PRL2_MASK                    equ 0004h
PWM1PRL_PWM1PRL3_POSN                    equ 0003h
PWM1PRL_PWM1PRL3_POSITION                equ 0003h
PWM1PRL_PWM1PRL3_SIZE                    equ 0001h
PWM1PRL_PWM1PRL3_LENGTH                  equ 0001h
PWM1PRL_PWM1PRL3_MASK                    equ 0008h
PWM1PRL_PWM1PRL4_POSN                    equ 0004h
PWM1PRL_PWM1PRL4_POSITION                equ 0004h
PWM1PRL_PWM1PRL4_SIZE                    equ 0001h
PWM1PRL_PWM1PRL4_LENGTH                  equ 0001h
PWM1PRL_PWM1PRL4_MASK                    equ 0010h
PWM1PRL_PWM1PRL5_POSN                    equ 0005h
PWM1PRL_PWM1PRL5_POSITION                equ 0005h
PWM1PRL_PWM1PRL5_SIZE                    equ 0001h
PWM1PRL_PWM1PRL5_LENGTH                  equ 0001h
PWM1PRL_PWM1PRL5_MASK                    equ 0020h
PWM1PRL_PWM1PRL6_POSN                    equ 0006h
PWM1PRL_PWM1PRL6_POSITION                equ 0006h
PWM1PRL_PWM1PRL6_SIZE                    equ 0001h
PWM1PRL_PWM1PRL6_LENGTH                  equ 0001h
PWM1PRL_PWM1PRL6_MASK                    equ 0040h
PWM1PRL_PWM1PRL7_POSN                    equ 0007h
PWM1PRL_PWM1PRL7_POSITION                equ 0007h
PWM1PRL_PWM1PRL7_SIZE                    equ 0001h
PWM1PRL_PWM1PRL7_LENGTH                  equ 0001h
PWM1PRL_PWM1PRL7_MASK                    equ 0080h
PWM1PRL_PWM1PRL_POSN                     equ 0000h
PWM1PRL_PWM1PRL_POSITION                 equ 0000h
PWM1PRL_PWM1PRL_SIZE                     equ 0008h
PWM1PRL_PWM1PRL_LENGTH                   equ 0008h
PWM1PRL_PWM1PRL_MASK                     equ 00FFh

// Register: PWM1PRH
#define PWM1PRH PWM1PRH
PWM1PRH                                  equ 0D96h
// bitfield definitions
PWM1PRH_PR_POSN                          equ 0000h
PWM1PRH_PR_POSITION                      equ 0000h
PWM1PRH_PR_SIZE                          equ 0008h
PWM1PRH_PR_LENGTH                        equ 0008h
PWM1PRH_PR_MASK                          equ 00FFh
PWM1PRH_PWM1PRH0_POSN                    equ 0000h
PWM1PRH_PWM1PRH0_POSITION                equ 0000h
PWM1PRH_PWM1PRH0_SIZE                    equ 0001h
PWM1PRH_PWM1PRH0_LENGTH                  equ 0001h
PWM1PRH_PWM1PRH0_MASK                    equ 0001h
PWM1PRH_PWM1PRH1_POSN                    equ 0001h
PWM1PRH_PWM1PRH1_POSITION                equ 0001h
PWM1PRH_PWM1PRH1_SIZE                    equ 0001h
PWM1PRH_PWM1PRH1_LENGTH                  equ 0001h
PWM1PRH_PWM1PRH1_MASK                    equ 0002h
PWM1PRH_PWM1PRH2_POSN                    equ 0002h
PWM1PRH_PWM1PRH2_POSITION                equ 0002h
PWM1PRH_PWM1PRH2_SIZE                    equ 0001h
PWM1PRH_PWM1PRH2_LENGTH                  equ 0001h
PWM1PRH_PWM1PRH2_MASK                    equ 0004h
PWM1PRH_PWM1PRH3_POSN                    equ 0003h
PWM1PRH_PWM1PRH3_POSITION                equ 0003h
PWM1PRH_PWM1PRH3_SIZE                    equ 0001h
PWM1PRH_PWM1PRH3_LENGTH                  equ 0001h
PWM1PRH_PWM1PRH3_MASK                    equ 0008h
PWM1PRH_PWM1PRH4_POSN                    equ 0004h
PWM1PRH_PWM1PRH4_POSITION                equ 0004h
PWM1PRH_PWM1PRH4_SIZE                    equ 0001h
PWM1PRH_PWM1PRH4_LENGTH                  equ 0001h
PWM1PRH_PWM1PRH4_MASK                    equ 0010h
PWM1PRH_PWM1PRH5_POSN                    equ 0005h
PWM1PRH_PWM1PRH5_POSITION                equ 0005h
PWM1PRH_PWM1PRH5_SIZE                    equ 0001h
PWM1PRH_PWM1PRH5_LENGTH                  equ 0001h
PWM1PRH_PWM1PRH5_MASK                    equ 0020h
PWM1PRH_PWM1PRH6_POSN                    equ 0006h
PWM1PRH_PWM1PRH6_POSITION                equ 0006h
PWM1PRH_PWM1PRH6_SIZE                    equ 0001h
PWM1PRH_PWM1PRH6_LENGTH                  equ 0001h
PWM1PRH_PWM1PRH6_MASK                    equ 0040h
PWM1PRH_PWM1PRH7_POSN                    equ 0007h
PWM1PRH_PWM1PRH7_POSITION                equ 0007h
PWM1PRH_PWM1PRH7_SIZE                    equ 0001h
PWM1PRH_PWM1PRH7_LENGTH                  equ 0001h
PWM1PRH_PWM1PRH7_MASK                    equ 0080h
PWM1PRH_PWM1PRH_POSN                     equ 0000h
PWM1PRH_PWM1PRH_POSITION                 equ 0000h
PWM1PRH_PWM1PRH_SIZE                     equ 0008h
PWM1PRH_PWM1PRH_LENGTH                   equ 0008h
PWM1PRH_PWM1PRH_MASK                     equ 00FFh

// Register: PWM1OFL
#define PWM1OFL PWM1OFL
PWM1OFL                                  equ 0D97h
// bitfield definitions
PWM1OFL_OF_POSN                          equ 0000h
PWM1OFL_OF_POSITION                      equ 0000h
PWM1OFL_OF_SIZE                          equ 0008h
PWM1OFL_OF_LENGTH                        equ 0008h
PWM1OFL_OF_MASK                          equ 00FFh
PWM1OFL_PWM1OFL0_POSN                    equ 0000h
PWM1OFL_PWM1OFL0_POSITION                equ 0000h
PWM1OFL_PWM1OFL0_SIZE                    equ 0001h
PWM1OFL_PWM1OFL0_LENGTH                  equ 0001h
PWM1OFL_PWM1OFL0_MASK                    equ 0001h
PWM1OFL_PWM1OFL1_POSN                    equ 0001h
PWM1OFL_PWM1OFL1_POSITION                equ 0001h
PWM1OFL_PWM1OFL1_SIZE                    equ 0001h
PWM1OFL_PWM1OFL1_LENGTH                  equ 0001h
PWM1OFL_PWM1OFL1_MASK                    equ 0002h
PWM1OFL_PWM1OFL2_POSN                    equ 0002h
PWM1OFL_PWM1OFL2_POSITION                equ 0002h
PWM1OFL_PWM1OFL2_SIZE                    equ 0001h
PWM1OFL_PWM1OFL2_LENGTH                  equ 0001h
PWM1OFL_PWM1OFL2_MASK                    equ 0004h
PWM1OFL_PWM1OFL3_POSN                    equ 0003h
PWM1OFL_PWM1OFL3_POSITION                equ 0003h
PWM1OFL_PWM1OFL3_SIZE                    equ 0001h
PWM1OFL_PWM1OFL3_LENGTH                  equ 0001h
PWM1OFL_PWM1OFL3_MASK                    equ 0008h
PWM1OFL_PWM1OFL4_POSN                    equ 0004h
PWM1OFL_PWM1OFL4_POSITION                equ 0004h
PWM1OFL_PWM1OFL4_SIZE                    equ 0001h
PWM1OFL_PWM1OFL4_LENGTH                  equ 0001h
PWM1OFL_PWM1OFL4_MASK                    equ 0010h
PWM1OFL_PWM1OFL5_POSN                    equ 0005h
PWM1OFL_PWM1OFL5_POSITION                equ 0005h
PWM1OFL_PWM1OFL5_SIZE                    equ 0001h
PWM1OFL_PWM1OFL5_LENGTH                  equ 0001h
PWM1OFL_PWM1OFL5_MASK                    equ 0020h
PWM1OFL_PWM1OFL6_POSN                    equ 0006h
PWM1OFL_PWM1OFL6_POSITION                equ 0006h
PWM1OFL_PWM1OFL6_SIZE                    equ 0001h
PWM1OFL_PWM1OFL6_LENGTH                  equ 0001h
PWM1OFL_PWM1OFL6_MASK                    equ 0040h
PWM1OFL_PWM1OFL7_POSN                    equ 0007h
PWM1OFL_PWM1OFL7_POSITION                equ 0007h
PWM1OFL_PWM1OFL7_SIZE                    equ 0001h
PWM1OFL_PWM1OFL7_LENGTH                  equ 0001h
PWM1OFL_PWM1OFL7_MASK                    equ 0080h
PWM1OFL_PWM1OFL_POSN                     equ 0000h
PWM1OFL_PWM1OFL_POSITION                 equ 0000h
PWM1OFL_PWM1OFL_SIZE                     equ 0008h
PWM1OFL_PWM1OFL_LENGTH                   equ 0008h
PWM1OFL_PWM1OFL_MASK                     equ 00FFh

// Register: PWM1OFH
#define PWM1OFH PWM1OFH
PWM1OFH                                  equ 0D98h
// bitfield definitions
PWM1OFH_OF_POSN                          equ 0000h
PWM1OFH_OF_POSITION                      equ 0000h
PWM1OFH_OF_SIZE                          equ 0008h
PWM1OFH_OF_LENGTH                        equ 0008h
PWM1OFH_OF_MASK                          equ 00FFh
PWM1OFH_PWM1OFH0_POSN                    equ 0000h
PWM1OFH_PWM1OFH0_POSITION                equ 0000h
PWM1OFH_PWM1OFH0_SIZE                    equ 0001h
PWM1OFH_PWM1OFH0_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH0_MASK                    equ 0001h
PWM1OFH_PWM1OFH1_POSN                    equ 0001h
PWM1OFH_PWM1OFH1_POSITION                equ 0001h
PWM1OFH_PWM1OFH1_SIZE                    equ 0001h
PWM1OFH_PWM1OFH1_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH1_MASK                    equ 0002h
PWM1OFH_PWM1OFH2_POSN                    equ 0002h
PWM1OFH_PWM1OFH2_POSITION                equ 0002h
PWM1OFH_PWM1OFH2_SIZE                    equ 0001h
PWM1OFH_PWM1OFH2_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH2_MASK                    equ 0004h
PWM1OFH_PWM1OFH3_POSN                    equ 0003h
PWM1OFH_PWM1OFH3_POSITION                equ 0003h
PWM1OFH_PWM1OFH3_SIZE                    equ 0001h
PWM1OFH_PWM1OFH3_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH3_MASK                    equ 0008h
PWM1OFH_PWM1OFH4_POSN                    equ 0004h
PWM1OFH_PWM1OFH4_POSITION                equ 0004h
PWM1OFH_PWM1OFH4_SIZE                    equ 0001h
PWM1OFH_PWM1OFH4_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH4_MASK                    equ 0010h
PWM1OFH_PWM1OFH5_POSN                    equ 0005h
PWM1OFH_PWM1OFH5_POSITION                equ 0005h
PWM1OFH_PWM1OFH5_SIZE                    equ 0001h
PWM1OFH_PWM1OFH5_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH5_MASK                    equ 0020h
PWM1OFH_PWM1OFH6_POSN                    equ 0006h
PWM1OFH_PWM1OFH6_POSITION                equ 0006h
PWM1OFH_PWM1OFH6_SIZE                    equ 0001h
PWM1OFH_PWM1OFH6_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH6_MASK                    equ 0040h
PWM1OFH_PWM1OFH7_POSN                    equ 0007h
PWM1OFH_PWM1OFH7_POSITION                equ 0007h
PWM1OFH_PWM1OFH7_SIZE                    equ 0001h
PWM1OFH_PWM1OFH7_LENGTH                  equ 0001h
PWM1OFH_PWM1OFH7_MASK                    equ 0080h
PWM1OFH_PWM1OFH_POSN                     equ 0000h
PWM1OFH_PWM1OFH_POSITION                 equ 0000h
PWM1OFH_PWM1OFH_SIZE                     equ 0008h
PWM1OFH_PWM1OFH_LENGTH                   equ 0008h
PWM1OFH_PWM1OFH_MASK                     equ 00FFh

