GopalSaraf/Practicals/PSDL/include/proc/pic12f1572.inc
#define PWM2PRL2                         BANKMASK(PWM2PRL), 2
#define PWM2PRL3                         BANKMASK(PWM2PRL), 3
#define PWM2PRL4                         BANKMASK(PWM2PRL), 4
#define PWM2PRL5                         BANKMASK(PWM2PRL), 5
#define PWM2PRL6                         BANKMASK(PWM2PRL), 6
#define PWM2PRL7                         BANKMASK(PWM2PRL), 7
#define PWM2PS0                          BANKMASK(PWM2CLKCON), 4
#define PWM2PS1                          BANKMASK(PWM2CLKCON), 5
#define PWM2PS2                          BANKMASK(PWM2CLKCON), 6
#define PWM2TMRH0                        BANKMASK(PWM2TMRH), 0
#define PWM2TMRH1                        BANKMASK(PWM2TMRH), 1
#define PWM2TMRH2                        BANKMASK(PWM2TMRH), 2
#define PWM2TMRH3                        BANKMASK(PWM2TMRH), 3
#define PWM2TMRH4                        BANKMASK(PWM2TMRH), 4
#define PWM2TMRH5                        BANKMASK(PWM2TMRH), 5
#define PWM2TMRH6                        BANKMASK(PWM2TMRH), 6
#define PWM2TMRH7                        BANKMASK(PWM2TMRH), 7
#define PWM2TMRL0                        BANKMASK(PWM2TMRL), 0
#define PWM2TMRL1                        BANKMASK(PWM2TMRL), 1
#define PWM2TMRL2                        BANKMASK(PWM2TMRL), 2
#define PWM2TMRL3                        BANKMASK(PWM2TMRL), 3
#define PWM2TMRL4                        BANKMASK(PWM2TMRL), 4
#define PWM2TMRL5                        BANKMASK(PWM2TMRL), 5
#define PWM2TMRL6                        BANKMASK(PWM2TMRL), 6
#define PWM2TMRL7                        BANKMASK(PWM2TMRL), 7
#define PWM3CS0                          BANKMASK(PWM3CLKCON), 0
#define PWM3CS1                          BANKMASK(PWM3CLKCON), 1
#define PWM3DCH0                         BANKMASK(PWM3DCH), 0
#define PWM3DCH1                         BANKMASK(PWM3DCH), 1
#define PWM3DCH2                         BANKMASK(PWM3DCH), 2
#define PWM3DCH3                         BANKMASK(PWM3DCH), 3
#define PWM3DCH4                         BANKMASK(PWM3DCH), 4
#define PWM3DCH5                         BANKMASK(PWM3DCH), 5
#define PWM3DCH6                         BANKMASK(PWM3DCH), 6
#define PWM3DCH7                         BANKMASK(PWM3DCH), 7
#define PWM3DCIE                         BANKMASK(PWM3INTE), 1
#define PWM3DCIF                         BANKMASK(PWM3INTF), 1
#define PWM3DCL0                         BANKMASK(PWM3DCL), 0
#define PWM3DCL1                         BANKMASK(PWM3DCL), 1
#define PWM3DCL2                         BANKMASK(PWM3DCL), 2
#define PWM3DCL3                         BANKMASK(PWM3DCL), 3
#define PWM3DCL4                         BANKMASK(PWM3DCL), 4
#define PWM3DCL5                         BANKMASK(PWM3DCL), 5
#define PWM3DCL6                         BANKMASK(PWM3DCL), 6
#define PWM3DCL7                         BANKMASK(PWM3DCL), 7
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3EN_A                         BANKMASK(PWMEN), 2
#define PWM3IE                           BANKMASK(PIE3), 6
#define PWM3IF                           BANKMASK(PIR3), 6
#define PWM3LD                           BANKMASK(PWM3LDCON), 7
#define PWM3LDA_A                        BANKMASK(PWMLD), 2
#define PWM3LDM                          BANKMASK(PWM3LDCON), 6
#define PWM3LDS0                         BANKMASK(PWM3LDCON), 0
#define PWM3LDS1                         BANKMASK(PWM3LDCON), 1
#define PWM3MODE0                        BANKMASK(PWM3CON), 2
#define PWM3MODE1                        BANKMASK(PWM3CON), 3
#define PWM3OE                           BANKMASK(PWM3CON), 6
#define PWM3OFH0                         BANKMASK(PWM3OFH), 0
#define PWM3OFH1                         BANKMASK(PWM3OFH), 1
#define PWM3OFH2                         BANKMASK(PWM3OFH), 2
#define PWM3OFH3                         BANKMASK(PWM3OFH), 3
#define PWM3OFH4                         BANKMASK(PWM3OFH), 4
#define PWM3OFH5                         BANKMASK(PWM3OFH), 5
#define PWM3OFH6                         BANKMASK(PWM3OFH), 6
#define PWM3OFH7                         BANKMASK(PWM3OFH), 7
#define PWM3OFIE                         BANKMASK(PWM3INTE), 3
#define PWM3OFIF                         BANKMASK(PWM3INTF), 3
#define PWM3OFL0                         BANKMASK(PWM3OFL), 0
#define PWM3OFL1                         BANKMASK(PWM3OFL), 1
#define PWM3OFL2                         BANKMASK(PWM3OFL), 2
#define PWM3OFL3                         BANKMASK(PWM3OFL), 3
#define PWM3OFL4                         BANKMASK(PWM3OFL), 4
#define PWM3OFL5                         BANKMASK(PWM3OFL), 5
#define PWM3OFL6                         BANKMASK(PWM3OFL), 6
#define PWM3OFL7                         BANKMASK(PWM3OFL), 7
#define PWM3OFM0                         BANKMASK(PWM3OFCON), 5
#define PWM3OFM1                         BANKMASK(PWM3OFCON), 6
#define PWM3OFMC                         BANKMASK(PWM3OFCON), 4
#define PWM3OFS0                         BANKMASK(PWM3OFCON), 0
#define PWM3OFS1                         BANKMASK(PWM3OFCON), 1
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3OUT_A                        BANKMASK(PWMOUT), 2
#define PWM3PHH0                         BANKMASK(PWM3PHH), 0
#define PWM3PHH1                         BANKMASK(PWM3PHH), 1
#define PWM3PHH2                         BANKMASK(PWM3PHH), 2
#define PWM3PHH3                         BANKMASK(PWM3PHH), 3
#define PWM3PHH4                         BANKMASK(PWM3PHH), 4
#define PWM3PHH5                         BANKMASK(PWM3PHH), 5
#define PWM3PHH6                         BANKMASK(PWM3PHH), 6
#define PWM3PHH7                         BANKMASK(PWM3PHH), 7
#define PWM3PHIE                         BANKMASK(PWM3INTE), 2
#define PWM3PHIF                         BANKMASK(PWM3INTF), 2
#define PWM3PHL0                         BANKMASK(PWM3PHL), 0
#define PWM3PHL1                         BANKMASK(PWM3PHL), 1
#define PWM3PHL2                         BANKMASK(PWM3PHL), 2
#define PWM3PHL3                         BANKMASK(PWM3PHL), 3
#define PWM3PHL4                         BANKMASK(PWM3PHL), 4
#define PWM3PHL5                         BANKMASK(PWM3PHL), 5
#define PWM3PHL6                         BANKMASK(PWM3PHL), 6
#define PWM3PHL7                         BANKMASK(PWM3PHL), 7
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM3PRH0                         BANKMASK(PWM3PRH), 0
#define PWM3PRH1                         BANKMASK(PWM3PRH), 1
#define PWM3PRH2                         BANKMASK(PWM3PRH), 2
#define PWM3PRH3                         BANKMASK(PWM3PRH), 3
#define PWM3PRH4                         BANKMASK(PWM3PRH), 4
#define PWM3PRH5                         BANKMASK(PWM3PRH), 5
#define PWM3PRH6                         BANKMASK(PWM3PRH), 6
#define PWM3PRH7                         BANKMASK(PWM3PRH), 7
#define PWM3PRIE                         BANKMASK(PWM3INTE), 0
#define PWM3PRIF                         BANKMASK(PWM3INTF), 0
#define PWM3PRL0                         BANKMASK(PWM3PRL), 0
#define PWM3PRL1                         BANKMASK(PWM3PRL), 1
#define PWM3PRL2                         BANKMASK(PWM3PRL), 2
#define PWM3PRL3                         BANKMASK(PWM3PRL), 3
#define PWM3PRL4                         BANKMASK(PWM3PRL), 4
#define PWM3PRL5                         BANKMASK(PWM3PRL), 5
#define PWM3PRL6                         BANKMASK(PWM3PRL), 6
#define PWM3PRL7                         BANKMASK(PWM3PRL), 7
#define PWM3PS0                          BANKMASK(PWM3CLKCON), 4
#define PWM3PS1                          BANKMASK(PWM3CLKCON), 5
#define PWM3PS2                          BANKMASK(PWM3CLKCON), 6
#define PWM3TMRH0                        BANKMASK(PWM3TMRH), 0
#define PWM3TMRH1                        BANKMASK(PWM3TMRH), 1
#define PWM3TMRH2                        BANKMASK(PWM3TMRH), 2
#define PWM3TMRH3                        BANKMASK(PWM3TMRH), 3
#define PWM3TMRH4                        BANKMASK(PWM3TMRH), 4
#define PWM3TMRH5                        BANKMASK(PWM3TMRH), 5
#define PWM3TMRH6                        BANKMASK(PWM3TMRH), 6
#define PWM3TMRH7                        BANKMASK(PWM3TMRH), 7
#define PWM3TMRL0                        BANKMASK(PWM3TMRL), 0
#define PWM3TMRL1                        BANKMASK(PWM3TMRL), 1
#define PWM3TMRL2                        BANKMASK(PWM3TMRL), 2
#define PWM3TMRL3                        BANKMASK(PWM3TMRL), 3
#define PWM3TMRL4                        BANKMASK(PWM3TMRL), 4
#define PWM3TMRL5                        BANKMASK(PWM3TMRL), 5
#define PWM3TMRL6                        BANKMASK(PWM3TMRL), 6
#define PWM3TMRL7                        BANKMASK(PWM3TMRL), 7
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RCIDL                            BANKMASK(BAUDCON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(PMCON1), 0
#define RX9                              BANKMASK(RCSTA), 6
#define RX9D                             BANKMASK(RCSTA), 0
#define RXDTSEL                          BANKMASK(APFCON), 7
#define SBOREN                           BANKMASK(BORCON), 7
#define SCKP                             BANKMASK(BAUDCON), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SENDB                            BANKMASK(TXSTA), 3
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SPEN                             BANKMASK(RCSTA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SREN                             BANKMASK(RCSTA), 5
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC                             BANKMASK(TXSTA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSEL                           BANKMASK(APFCON), 3
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T2OUTPS0                         BANKMASK(T2CON), 3
#define T2OUTPS1                         BANKMASK(T2CON), 4
#define T2OUTPS2                         BANKMASK(T2CON), 5
#define T2OUTPS3                         BANKMASK(T2CON), 6
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TRIGSEL0                         BANKMASK(ADCON2), 4
#define TRIGSEL1                         BANKMASK(ADCON2), 5
#define TRIGSEL2                         BANKMASK(ADCON2), 6
#define TRIGSEL3                         BANKMASK(ADCON2), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRMT                             BANKMASK(TXSTA), 1
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TUN5                             BANKMASK(OSCTUNE), 5
#define TX9                              BANKMASK(TXSTA), 6
#define TX9D                             BANKMASK(TXSTA), 0
#define TXCKSEL                          BANKMASK(APFCON), 2
#define TXEN                             BANKMASK(TXSTA), 5
#define TXIE                             BANKMASK(PIE1), 4
#define TXIF                             BANKMASK(PIR1), 4
#define VREGPM                           BANKMASK(VREGCON), 1
#define WDTPS0                           BANKMASK(WDTCON), 1
#define WDTPS1                           BANKMASK(WDTCON), 2
#define WDTPS2                           BANKMASK(WDTCON), 3
#define WDTPS3                           BANKMASK(WDTCON), 4
#define WDTPS4                           BANKMASK(WDTCON), 5
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WR                               BANKMASK(PMCON1), 1
#define WREN                             BANKMASK(PMCON1), 2
#define WRERR                            BANKMASK(PMCON1), 3
#define WUE                              BANKMASK(BAUDCON), 1
#define ZERO                             BANKMASK(STATUS), 2
#define Z_SHAD                           BANKMASK(STATUS_SHAD), 2
#define nBOR                             BANKMASK(PCON), 0
#define nDONE                            BANKMASK(ADCON0), 1
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nRI                              BANKMASK(PCON), 2
#define nRMCLR                           BANKMASK(PCON), 3
#define nRWDT                            BANKMASK(PCON), 4
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nWPUEN                           BANKMASK(OPTION_REG), 7

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC12F1572_INC_
